<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/1_Pivot_With_Case_Statements/3_Advanced_Segmentation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Advanced Segmentation

## Overview

### ðŸ¥… Analysis Goals

- **ðŸ“Š Revenue Tiers with Percentiles:** Segment sales into **Low, Medium, and High** based on the **25th (Q1) and 75th (Q3) percentiles** to establish meaningful thresholds for performance evaluation.
- **ðŸ“ˆ Revenue Aggregation by Category & Tier:** Evaluate how different categories contribute to total sales by **aggregating revenue within each tier**.

### ðŸ“˜ Concepts Covered

- Pivot with multiple different aggregations
- Pivots with `AND` in a `CASE WHEN` Condition
- Pivoting with Multiple `WHEN` Clauses in a Single `CASE` Block

---

In [1]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---

## Using AND in a CASE WHEN Condition

### ðŸ“Â Notes

**`AND` in a `CASE WHEN` condition** is used to combine multiple criteria that must all be true for the condition to apply. This allows for more specific filtering within a single `CASE` block.

- **Syntax**:

    ```sql
    SELECT
      CASE 
        WHEN condition1 AND condition2 THEN column
      END AS alias
    FROM table_name;
    ```

- **Example**:

Using `AND` in a `CASE WHEN` condition to categorize:
- "High Value Order" if `quantity >= 2` and `netprice >= 50`
- "Standard Order" otherwise

In [22]:
%%sql

SELECT 
    orderdate,
    quantity,
    netprice,
    CASE 
        WHEN quantity >= 2 AND netprice >= 50 THEN 'High Value Order'
        ELSE 'Standard Order'
    END AS order_type
FROM sales
ORDER BY orderdate
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

    orderdate  quantity  netprice        order_type
0  2015-01-01         1    659.78    Standard Order
1  2015-01-01         2     54.38  High Value Order
2  2015-01-01         4    286.69  High Value Order
3  2015-01-01         7    135.75  High Value Order
4  2015-01-01         3    434.30  High Value Order
5  2015-01-01         1     58.73    Standard Order
6  2015-01-01         3     74.99  High Value Order
7  2015-01-01         2    113.57  High Value Order
8  2015-01-01         1    499.45    Standard Order
9  2015-01-01         1     98.97    Standard Order

### ðŸ“ˆ Analysis

- Categorizing net revenue into "low" and "high" using the median ensures meaningful divisions based on the actual data, instead of guessing.

#### Categorize as Low and High for Total Net Revenue

**`SUM`**, **`CASE WHEN`**, **`PERCENTILE_CONT`**

1. Use `PERCENTILE_CONT` to find the median net revenue between 2022 and 2023.  
    - Calculate the median by specifying `PERCENTILE_CONT(0.5)` within a `WITHIN GROUP (ORDER BY)` clause.  
    - Multiply `quantity`, `netprice`, and `exchangerate` to determine net revenue for each row.  
    - Filter the `sales` table for `orderdate` values between January 1, 2022, and December 31, 2023.

In [23]:
%%sql

SELECT 
    PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS median
FROM 
    sales s
WHERE 
    orderdate BETWEEN '2022-01-01' AND '2023-12-31'

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   median
0  398.00

2. Calculate total net revenue by category and categorize it into "low" and "high" based on the median.   
    - ðŸ”” Aggregate total net revenue for each category using `SUM`.  
    - ðŸ”” Classify rows as "low" or "high" using `CASE WHEN` with conditions comparing net revenue to the median value.  
        - "low" is `<` the median
        - "high" is `>=` the median
    - Filter the data for `orderdate` values between 2022 and 2023.  
    - ðŸ”” Group results by `categoryname` and order by category.

In [24]:
%%sql 

SELECT -- Updated
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < 398 
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_net_revenue,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= 398 
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey --Added 
WHERE
    orderdate BETWEEN '2022-01-01' AND '2023-12-31' 
GROUP BY
    category --Added 
ORDER BY
    category --Added 
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  low_net_revenue  high_net_revenue
0                          Audio        402588.95        1053039.44
1        Cameras and camcorders         237874.00        4128204.85
2                    Cell phones       1544148.92       12577663.79
3                      Computers       1215130.73       28297949.97
4                 Games and Toys        438083.00         148419.27
5                Home Appliances        396058.42       12136381.13
6  Music, Movies and Audio Books       1260767.25        3909298.16
7                   TV and Video        436613.64        9790901.19

3. Add year-based filters in `CASE WHEN` to calculate "low" and "high" net revenue for 2022 and 2023 separately.  
    - ðŸ”” Add conditions within `CASE WHEN` to filter `orderdate` by specific years (2022 or 2023).  
    - Categorize revenue into "low" or "high" based on comparisons with the median value.  
        - "low" is `<` the median
        - "high" is `>=` the median
    - Aggregate revenue for each category and year combination using `SUM`.  
    - Group the data by `categoryname` and order by category.

In [25]:
%%sql

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < 398
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= 398
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < 398
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2023,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= 398
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2023
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,low_revenue_2022,high_revenue_2022,low_revenue_2023,high_revenue_2023
0,Audio,222337.83,544600.39,180251.13,508439.06
1,Cameras and camcorders,133004.54,2249528.02,104869.46,1878676.83
2,Cell phones,814449.53,7305215.55,729699.39,5272448.24
3,Computers,624340.42,17237873.07,590790.31,11060076.90
4,Games and Toys,231979.63,84147.67,206103.36,64271.60
5,Home Appliances,219797.07,6392649.61,176261.35,5743731.52
6,"Music, Movies and Audio Books",685808.49,2303488.80,574958.76,1605809.37
7,TV and Video,272338.29,5542998.32,164275.35,4247902.87

4. Use a CTE to calculate the median dynamically and include it in the main query.
    - ðŸ”” Create a CTE using `PERCENTILE_CONT(0.5)` to calculate the median dynamically for all sales between 2022 and 2023.  
    - ðŸ”” Reference the CTE in the `FROM` clause to make the percentile values available in the main query without hardcoding thresholds.   
    - ðŸ”” Replace hardcoded median thresholds in `CASE WHEN` with the dynamically calculated median from the CTE.  
    - Filter and aggregate net revenue for "low" and "high" categories by year, grouped by category.

In [26]:
%%sql

-- Calculate the median values
WITH median_value AS (
    SELECT 
        PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS median
    FROM sales s
    WHERE orderdate BETWEEN '2022-01-01' AND '2023-12-31'
)

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < mv.median 
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= mv.median 
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < mv.median 
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2023,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= mv.median 
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2023
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey,
    median_value mv  -- Alias applied here
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,low_revenue_2022,high_revenue_2022,low_revenue_2023,high_revenue_2023
0,Audio,222337.83,544600.39,180251.13,508439.06
1,Cameras and camcorders,133004.54,2249528.02,104869.46,1878676.83
2,Cell phones,814449.53,7305215.55,729699.39,5272448.24
3,Computers,624340.42,17237873.07,590790.31,11060076.90
4,Games and Toys,231979.63,84147.67,206103.36,64271.60
5,Home Appliances,219797.07,6392649.61,176261.35,5743731.52
6,"Music, Movies and Audio Books",685808.49,2303488.80,574958.76,1605809.37
7,TV and Video,272338.29,5542998.32,164275.35,4247902.87

<img src="../Resources/images/1.3_Rev_Spread.png" alt="Revenue Spread" width="50%">

<img src="../Resources/images/1.3_Rev_Spread_100.png" alt="Revenue Spread 100%" width="50%">

5. **(BONUS)** Technically, it would be more accurate to calculate the median for each category separately.
    - ðŸ”” Calculate the median for each category separately using `PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate))`.
    - ðŸ”” Use `AVG` to get a single median value for each category.
    - ðŸ”” Use `LEFT JOIN` to join the `category_medians` CTE to the `product` table.

In [27]:
%%sql

WITH category_medians AS (
    SELECT 
        p.categoryname,
        PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS median
    FROM sales s
    LEFT JOIN product p ON s.productkey = p.productkey
    WHERE s.orderdate BETWEEN '2022-01-01' AND '2023-12-31'
    GROUP BY p.categoryname
)

SELECT
    p.categoryname AS category,
    AVG(cm.median) AS median,  -- AVG needed to get a single median value
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < cm.median 
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= cm.median 
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < cm.median 
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2023,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= cm.median 
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2023
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
    LEFT JOIN category_medians cm ON p.categoryname = cm.categoryname
GROUP BY
    p.categoryname
ORDER BY
    p.categoryname

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,median,low_revenue_2022,high_revenue_2022,low_revenue_2023,high_revenue_2023
0,Audio,262.25,126838.74,640099.47,104149.73,584540.45
1,Cameras and camcorders,659.87,293581.87,2088950.69,233563.52,1749982.77
2,Cell phones,399.18,823209.90,7296455.17,738857.59,5263290.05
3,Computers,738.00,1786099.84,16076113.65,1477250.73,10173616.48
4,Games and Toys,33.12,29987.45,286139.85,26589.38,243785.58
5,Home Appliances,806.53,678256.92,5934189.76,553520.90,5366471.98
6,"Music, Movies and Audio Books",171.31,244819.89,2744477.39,218088.71,1962679.42
7,TV and Video,758.32,683842.56,5131494.05,460417.94,3951760.28

---
## Multiple WHEN Clauses in a Single CASE Block

### ðŸ“Â Notes

**Pivot with multiple `WHEN` clauses in a single `CASE` block in the same aggregation function** applies multiple `WHEN` conditions within a single aggregation, such as `COUNT`.

- Syntax:

    ```sql
    SELECT
        CASE 
          WHEN condition1 THEN column
          WHEN condition2 THEN column
          ELSE column
        END AS alias
    FROM table_name;
    ```

- Example:

Using multiple `WHEN` clauses in a single `CASE` block to categorize orders based on the quantity and net price:
- "Multiple High Value Items" if `quantity >= 2` and `netprice >= 100`
- "Single High Value Item" if `netprice >= 100`
- "Multiple Standard Items" if `quantity >= 2`
- "Single Standard Item" otherwise

In [28]:
%%sql

SELECT 
    orderdate,
    quantity,
    netprice,
    CASE 
        WHEN quantity >= 2 AND netprice >= 100 THEN 'Multiple High Value Items'
        WHEN netprice >= 100 THEN 'Single High Value Item'
        WHEN quantity >= 2 THEN 'Multiple Standard Items'
        ELSE 'Single Standard Item'
    END AS order_type
FROM sales
ORDER BY orderdate
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

    orderdate  quantity  netprice                 order_type
0  2015-01-01         1    659.78     Single High Value Item
1  2015-01-01         2     54.38    Multiple Standard Items
2  2015-01-01         4    286.69  Multiple High Value Items
3  2015-01-01         7    135.75  Multiple High Value Items
4  2015-01-01         3    434.30  Multiple High Value Items
5  2015-01-01         1     58.73       Single Standard Item
6  2015-01-01         3     74.99    Multiple Standard Items
7  2015-01-01         2    113.57  Multiple High Value Items
8  2015-01-01         1    499.45     Single High Value Item
9  2015-01-01         1     98.97       Single Standard Item

### ðŸ“ˆ Analysis

- Categorize total net revenue for each product category into three tiers: low, medium, and highâ€”based on the 25th and 75th percentiles of individual sales. This helps us separate out the sales performance by category.

#### Categorize Low, Moderate and High for Net Revenue

**`SUM`**, **`CASE WHEN`**, **`PERCENTILE_CONT`**

1. Calculate the minimum, 25th percentile (Q1), 75th percentile (Q3), and maximum for net revenue between 2022 and 2023.
    - Find the 25th and 75th percentiles for net revenue using `PERCENTILE_CONT` with `WITHIN GROUP (ORDER BY)`.
    - Filter sales data for rows where `orderdate` is between 2022-01-01, and 2023-12-31.
    - These percentiles define thresholds for "Low" (below Q1), "Medium" (Q1 to Q3), and "High" (above Q3) categories.
        - Low: Below the 25th percentile (Q1).
        - Moderate: Between the 25th and 75th percentiles (Q1 and Q3).
        - High: Above the 75th percentile (Q3).

In [29]:
%%sql 

SELECT
    PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_25th_percentile,
    PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_75th_percentile
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate BETWEEN '2022-01-01' AND '2023-12-31' 
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   net_revenue_25th_percentile  net_revenue_75th_percentile
0                       111.07                      1062.12

2. Dynamically calculate the percentiles using a CTE and incorporate them into the main query.
    - ðŸ”” Create a CTE (`WITH percentiles`) to calculate the 25th and 75th percentiles dynamically.  
    - ðŸ”” Reference the CTE in the `FROM` clause to make the percentile values available in the main query without hardcoding thresholds.  
    - ðŸ”” Replace static values in the `CASE` statement with percentile values from the CTE.  
    - Aggregate and categorize sales as in the previous steps while ensuring dynamic percentile usage.

In [3]:
%%sql

-- Calculate the percentiles, ADDED 
WITH percentiles AS (
    SELECT
        PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_25th_percentile,
        PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_75th_percentile
    FROM
        sales s
    WHERE
        orderdate BETWEEN '2022-01-01' AND '2023-12-31'
)
SELECT
    p.categoryname AS category,
    CASE 
        WHEN (s.quantity * s.netprice * s.exchangerate) < pctl.net_revenue_25th_percentile THEN '3 - LOW' -- Updated  
        WHEN (s.quantity * s.netprice * s.exchangerate) >= pctl.net_revenue_75th_percentile THEN '1 - HIGH' -- Updated
        ELSE '2 - MEDIUM' 
    END AS revenue_tier,
    SUM(s.quantity * s.netprice * s.exchangerate) AS total_revenue
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey,
    percentiles pctl -- ADDED
GROUP BY
    category, 
    revenue_tier -- ADDED
ORDER BY
    category, 
    revenue_tier -- ADDED
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

24 rows affected.

                         category revenue_tier  total_revenue
0                           Audio     1 - HIGH     1213265.71
1                           Audio   2 - MEDIUM     3832415.38
2                           Audio      3 - LOW      267217.01
3         Cameras and camcorders      1 - HIGH    15050781.63
4         Cameras and camcorders    2 - MEDIUM     3388546.10
5         Cameras and camcorders       3 - LOW       81032.92
6                     Cell phones     1 - HIGH    21874993.15
7                     Cell phones   2 - MEDIUM    10338963.22
8                     Cell phones      3 - LOW      410309.35
9                       Computers     1 - HIGH    79607760.89
10                      Computers   2 - MEDIUM    10808054.11
11                      Computers      3 - LOW      203207.06
12                 Games and Toys     1 - HIGH      133749.09
13                 Games and Toys   2 - MEDIUM     1001381.91
14                 Games and Toys      3 - LOW      533443.13
15                Home Appliances     1 - HIGH    22383475.30
16                Home Appliances   2 - MEDIUM     4118724.64
17                Home Appliances      3 - LOW      105045.60
18  Music, Movies and Audio Books     1 - HIGH     3844996.29
19  Music, Movies and Audio Books   2 - MEDIUM     6100817.99
20  Music, Movies and Audio Books      3 - LOW      642496.71
21                   TV and Video     1 - HIGH    16632856.33
22                   TV and Video   2 - MEDIUM     3766783.30
23                   TV and Video      3 - LOW       67221.76

<img src="../Resources/images/1.3_Rev_Tiers_Grouped.png" alt="Revenue Tiers Grouped" width="50%">
<img src="../Resources/images/1.3_Rev_Tiers_Stacked.png" alt="Revenue Tiers Stacked" width="50%">

3. **(BONUS)** Technically, it would be more accurate to calculate the 25th and 75th percentiles for each category separately.
    - ðŸ”” Calculate the 25th and 75th percentiles for each category separately using `PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate))` and `PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate))`.
    - ðŸ”” Use `LEFT JOIN` to join the `category_percentiles` CTE to the `product` table.
    - ðŸ”” Group by `categoryname`, `q1_threshold`, `q3_threshold`, and `revenue_tier` for meaningful segmentation.
    - ðŸ”” Add `q1_threshold` and `q3_threshold` to the `GROUP BY` clause for better readability.

In [4]:
%%sql

WITH category_percentiles AS (
    SELECT 
        p.categoryname,
        PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS net_revenue_25th_percentile,
        PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS net_revenue_75th_percentile
    FROM sales s
    LEFT JOIN product p ON s.productkey = p.productkey
    WHERE orderdate BETWEEN '2022-01-01' AND '2023-12-31'
    GROUP BY p.categoryname
)

SELECT
    p.categoryname AS category,
    cp.net_revenue_25th_percentile AS q1_threshold,  -- Added
    cp.net_revenue_75th_percentile AS q3_threshold,  -- Added
    CASE 
        WHEN (s.quantity * s.netprice * s.exchangerate) < cp.net_revenue_25th_percentile THEN '3 - LOW' -- Updated  
        WHEN (s.quantity * s.netprice * s.exchangerate) >= cp.net_revenue_75th_percentile THEN '1 - HIGH' -- Updated
        ELSE '2 - MEDIUM' 
    END AS revenue_tier,
    SUM(s.quantity * s.netprice * s.exchangerate) AS total_revenue
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
    LEFT JOIN category_percentiles cp ON p.categoryname = cp.categoryname
GROUP BY
    category,
    q1_threshold,  -- Added
    q3_threshold,  -- Added 
    revenue_tier
ORDER BY
    category, 
    revenue_tier;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

24 rows affected.

,category,q1_threshold,q3_threshold,revenue_tier,total_revenue
0,Audio,121.81,526.37,1 - HIGH,2941129.03
1,Audio,121.81,526.37,2 - MEDIUM,2050895.97
2,Audio,121.81,526.37,3 - LOW,320873.10
3,Cameras and camcorders,276.02,1536.86,1 - HIGH,13138022.15
4,Cameras and camcorders,276.02,1536.86,2 - MEDIUM,4948997.27
5,Cameras and camcorders,276.02,1536.86,3 - LOW,433341.24
6,Cell phones,116.96,949.41,1 - HIGH,23184004.60
7,Cell phones,116.96,949.41,2 - MEDIUM,9003092.56
8,Cell phones,116.96,949.41,3 - LOW,437168.56
9,Computers,294.00,1722.22,1 - HIGH,70324428.09
10,Computers,294.00,1722.22,2 - MEDIUM,19034411.27
11,Computers,294.00,1722.22,3 - LOW,1260182.69
12,Games and Toys,14.23,86.00,1 - HIGH,1242132.03
13,Games and Toys,14.23,86.00,2 - MEDIUM,384347.11
14,Games and Toys,14.23,86.00,3 - LOW,42095.00
15,Home Appliances,329.97,2032.00,1 - HIGH,18254257.41
16,Home Appliances,329.97,2032.00,2 - MEDIUM,7549804.92
17,Home Appliances,329.97,2032.00,3 - LOW,803183.21
18,"Music, Movies and Audio Books",52.92,463.92,1 - HIGH,7240385.67
19,"Music, Movies and Audio Books",52.92,463.92,2 - MEDIUM,3111159.14
20,"Music, Movies and Audio Books",52.92,463.92,3 - LOW,236766.18
21,TV and Video,329.47,1727.27,1 - HIGH,14257769.98
22,TV and Video,329.47,1727.27,2 - MEDIUM,5476831.14
23,TV and Video,329.47,1727.27,3 - LOW,732260.26